## Problem Statement 2:
### Readthe dataset from the below link

https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv

***

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

In [3]:
df.shape  #to know the number of rows and columns for the data in the dataframe

(1016395, 7)

In [4]:
df.head() #Gives the first 5 rows in the dataframe.Here df is my dataframe

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

***

#### Qn.1. Delete unnamed columns

In [5]:
df.columns                  #To know the unnamed column by knowing the column names

Index(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

In [6]:
df1=df.copy()            #Since the original dataframe should not be changed copying the df to another dataframe named df1

In [7]:
df1.drop("Unnamed: 0",axis=1,inplace=True) #Dropping the unnamed column using drop method.

In [8]:
df1.head() #Printing the first 5 rows to check if unnamed has been removed

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

### Qn.2. Show the distribution of male and female

In [9]:
both_genders=df1['Gender'].value_counts()

In [10]:
both_genders

F    558846
M    457549
Name: Gender, dtype: int64

In [11]:
genders=df1.groupby(['Gender'])

In [12]:
genders.describe()

           Count                                                       \
           count       mean         std  min  25%   50%   75%     max
Gender
F       558846.0  29.310925   75.962992  5.0  6.0  10.0  23.0  3634.0
M       457549.0  41.615650  118.074308  5.0  7.0  12.0  29.0  4167.0

              Id                 ...                               Year  \
           count          mean   ...           75%        max     count
Gender                           ...
F       558846.0  2.793178e+06   ...    4333051.75  5634124.0  558846.0
M       457549.0  2.877176e+06   ...    4241792.00  5647426.0  457549.0


               mean       std     min     25%     50%     75%     max
Gender
F       2009.026258  3.137428  2004.0  2006.0  2009.0  2012.0  2014.0
M       2009.086085  3.139039  2004.0  2006.0  2009.0  2012.0  2014.0

[2 rows x 24 columns]

#### Qn.3 Show the top 5 most preferred names

In [13]:
preferred_name=df1['Name'].value_counts()
preferred_name.head()                          #knowing the 5 most preferred name by knowing the value_counts for the 'Name 'column in df1 dataframe

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Name, dtype: int64

#### Qn.4. What is the median name occurence in the dataset

In [14]:
df1.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [15]:
df1.Id.median()

2811921.0

In [16]:
median_name=df1[df1['Id']==df1.Id.median()]

In [17]:
median_name

             Id   Name  Year Gender State  Count
508197  2811921  Kasey  2010      F    MO      6

#### Qn.5. Distribution of male and female born count by states

In [18]:
distribution=df1.groupby(['Gender','State']).count()
#Showing the distribution of male and female with respect to each State

In [19]:
distribution.loc[: , 'Count']

Gender  State
F       AK        2404
        AL        9878
        AR        7171
        AZ       14518
        CA       45144
        CO       11424
        CT        6575
        DC        3053
        DE        2549
        FL       25781
        GA       19385
        HI        3255
        IA        7131
        ID        4918
        IL       21268
        IN       13056
        KS        7753
        KY        8817
        LA       10510
        MA       10580
        MD       11276
        ME        2976
        MI       16038
        MN       10677
        MO       11948
        MS        7235
        MT        2690
        NC       17357
        ND        2399
        NE        5370
                 ...
M       ME        2777
        MI       13243
        MN        9004
        MO        9917
        MS        6862
        MT        2986
        NC       13530
        ND        2581
        NE        5029
        NH        2659
        NJ       12274
        NM        4966
        NV        6024
        NY       22585
        OH       14318
        OK        8138
        OR        7333
        PA       14171
        RI        2468
        SC        8195
        SD        2908
        TN       10588
        TX       27791
        UT        8233
        VA       11997
        VT        1618
        WA       11049
        WI        8940
        WV        3733
        WY        1904
Name: Count, Length: 102, dtype: int64

In [20]:
pd.crosstab(index=df1.Gender,columns=df1.State) #distribution in a more formatted way

State,AK,AL,AR,AZ,CA,CO,CT,DC,DE,FL,...,SD,TN,TX,UT,VA,VT,WA,WI,WV,WY
Gender,,,,,,,,,,,,,,,,,,,,,
F,2404,9878,7171,14518,45144,11424,6575,3053,2549,25781,...,2838,13063,39760,9515,14759,1398,13329,10549,4305,1456
M,2587,8419,6475,10820,31637,9183,5733,3000,2440,20070,...,2908,10588,27791,8233,11997,1618,11049,8940,3733,1904